**ASSIGNMENT DATA AQUISITION WITH SQL**

In [ ]:
# Loading the SQL extension
# ---
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
# Connecting to the in-memory SQLite database Google Colab
# ---
#  
%sql sqlite://

'Connected: @None'

In [ ]:
# Loading the pandas library
# ---
#
import pandas as pd

In [ ]:
T_accidents = pd.read_csv('traffic_accidents.csv') 

%sql DROP TABLE if EXISTS T_accidents;

%sql PERSIST T_accidents;

%sql SELECT * FROM T_accidents LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, '08/06/2015 06:00:00 PM', None, 'LINCOLN-CONTINENTAL', 'MKX', 2008.0, 'PASSENGER', 'NONE', 'N', 'PARKED', 0.0, None, 'PARKED', 'NOT IN USE'),
 (1, '08/10/2015 02:15:00 PM', None, 'MERCEDES-BENZ', 'C250', 2013.0, 'PASSENGER', 'NONE', 'S', 'STRAIGHT AHEAD', 1.0, None, 'DRIVER', 'PERSONAL'),
 (2, '08/15/2015 12:10:00 PM', None, 'MERCEDES-BENZ', 'GLK220', 2015.0, 'PASSENGER', 'NONE', 'E', 'STRAIGHT AHEAD', 1.0, None, 'DRIVER', 'OTHER'),
 (3, '08/16/2015 07:00:00 PM', 5.0, 'TOYOTA MOTOR COMPANY, LTD.', 'CAMRY', 2014.0, 'PASSENGER', 'NONE', 'W', 'SLOW/STOP - RIGHT TURN', 6.0, None, 'DRIVER', 'PERSONAL'),
 (4, '08/16/2015 01:45:00 PM', None, 'LEXUS', 'RX350', 2015.0, 'SPORT UTILITY VEHICLE (SUV)', 'NONE', 'N', 'PARKED', 0.0, None, 'PARKED', 'OTHER')]

In [ ]:
# Most personal vehicles involved in crashes were traveling towards which direction?
#Display a list of 5 makes that had the highest number of crashes?
# Assuming all records of models appear as a result of the accident
%%sql
SELECT MAKE, SUM(MODEL) FROM T_accidents
GROUP BY MAKE
ORDER BY SUM(MODEL) DESC
LIMIT 5

 * sqlite://
Done.

[('PERSONAL', 'W')]

In [ ]:
# Most personal vehicles involved in crashes were traveling towards which direction?
%%sql
SELECT VEHICLE_USE, TRAVEL_DIRECTION, COUNT(TRAVEL_DIRECTION) FROM T_accidents
WHERE VEHICLE_USE = 'PERSONAL'
GROUP BY TRAVEL_DIRECTION
ORDER BY COUNT(TRAVEL_DIRECTION) DESC

 * sqlite://
Done.

[('PERSONAL', 'N', 1099),
 ('PERSONAL', 'S', 1076),
 ('PERSONAL', 'W', 973),
 ('PERSONAL', 'E', 964),
 ('PERSONAL', 'UNKNOWN', 175),
 ('PERSONAL', 'SE', 73),
 ('PERSONAL', 'NW', 68),
 ('PERSONAL', 'SW', 42),
 ('PERSONAL', 'NE', 36)]

In [ ]:
#How many passengers were involved in personal cars were in accidents?

%%sql
SELECT VEHICLE_USE, SUM(NUM_PASSENGERS) FROM T_accidents
WHERE VEHICLE_USE = 'PERSONAL'

 * sqlite://
Done.

[('PERSONAL', 1146.0)]

In [ ]:
#How many passengers were involved in accidents while traveling in personal Sport Utility vehicles?

%%sql
SELECT VEHICLE_TYPE, SUM(NUM_PASSENGERS	) FROM T_accidents
WHERE VEHICLE_TYPE = 'SPORT UTILITY VEHICLE (SUV)'

 * sqlite://
Done.

[('SPORT UTILITY VEHICLE (SUV)', 256.0)]

In [ ]:
#Compute the total number of Mercedez-Benz vehicles involved in accidents while being parked

%%sql
SELECT MAKE, MANEUVER, SUM(MANEUVER) FROM T_accidents
WHERE MAKE = 'MERCEDES-BENZ' AND MANEUVER = 'PARKED' OR 'LEAVING TRAFFIC LANE TO PARK'

 * sqlite://
Done.

[('MERCEDES-BENZ', 'PARKED', 0.0)]

In [ ]:
#Compute the total occupant_count per vehicle count.

%%sql
SELECT MAKE, SUM(OCCUPANT_CNT) FROM T_accidents
GROUP BY MAKE
ORDER BY SUM(OCCUPANT_CNT) DESC
LIMIT 3

 * sqlite://
Done.

[('CHEVROLET', 881.0), ('FORD', 829.0), ('NISSAN', 708.0)]

In [ ]:
#Sort the number of passengers in descending order, by travel direction taking into
#account travel direction. Return travel direction and no. of passengers.

%%sql
SELECT TRAVEL_DIRECTION, SUM(NUM_PASSENGERS) FROM T_accidents
GROUP BY TRAVEL_DIRECTION
ORDER BY SUM(NUM_PASSENGERS) DESC

 * sqlite://
Done.

[('N', 395.0),
 ('S', 389.0),
 ('E', 353.0),
 ('W', 321.0),
 ('UNKNOWN', 42.0),
 ('NW', 28.0),
 ('SE', 21.0),
 ('NE', 19.0),
 ('SW', 10.0)]

In [ ]:
#Select the top 5 vehicle models involved in the accident with no defect, order them by make, and show their maneuver

 * sqlite://
Done.

[('EDGE', 4143, 4143, 0.0)]

In [ ]:
%%sql
SELECT MODEL,COUNT(MODEL), MAKE, MANEUVER FROM T_accidents
WHERE VEHICLE_DEFECT = 'NONE'
GROUP BY MODEL, MANEUVER
ORDER BY COUNT(MAKE) DESC
LIMIT 20

 * sqlite://
Done.

[('UNKNOWN', 159, 'CHEVROLET', 'STRAIGHT AHEAD'),
 ('CAMRY', 73, 'TOYOTA', 'STRAIGHT AHEAD'),
 ('NISSAN ALTIMA', 54, 'NISSAN', 'STRAIGHT AHEAD'),
 ('UNKNOWN', 53, 'INFINITI', 'PARKED'),
 ('OTHER (EXPLAIN IN NARRATIVE)', 51, 'FREIGHTLINER CORPORATION', 'STRAIGHT AHEAD'),
 ('COROLLA', 44, 'TOYOTA', 'STRAIGHT AHEAD'),
 ('UNKNOWN', 44, 'MAZDA', 'SLOW/STOP IN TRAFFIC'),
 ('CIVIC', 43, 'HONDA', 'STRAIGHT AHEAD'),
 ('ELANTRA', 37, 'HYUNDAI', 'STRAIGHT AHEAD'),
 ('CRUZE', 32, 'CHEVROLET', 'STRAIGHT AHEAD'),
 ('FUSION', 32, 'FORD', 'STRAIGHT AHEAD'),
 ('IMPALA', 32, 'CHEVROLET', 'STRAIGHT AHEAD'),
 ('SONATA', 31, 'HYUNDAI', 'STRAIGHT AHEAD'),
 ('ACCORD', 30, 'HONDA', 'STRAIGHT AHEAD'),
 ('MALIBU (CHEVELLE)', 30, 'CHEVROLET', 'STRAIGHT AHEAD'),
 ('EQUINOX', 29, 'CHEVROLET', 'STRAIGHT AHEAD'),
 ('ROGUE', 28, 'NISSAN', 'STRAIGHT AHEAD'),
 ('UNKNOWN', 26, 'DODGE', 'TURNING LEFT'),
 ('ESCAPE (SUV)', 25, 'FORD', 'STRAIGHT AHEAD'),
 ('CAMRY', 24, 'TOYOTA', 'PARKED')]

In [ ]:
#Which ridesharing vehicles in an accident had the most number of passengers?
#Return model, and the number of passengers.

%%sql
SELECT  MODEL, SUM(NUM_PASSENGERS) FROM T_accidents
WHERE VEHICLE_USE = 'RIDESHARE SERVICE'
GROUP BY MODEL
ORDER BY SUM(NUM_PASSENGERS) DESC

 * sqlite://
Done.

[('CAMRY', 5.0),
 ('UNKNOWN', 5.0),
 ('JETTA', 4.0),
 ('COROLLA', 3.0),
 ('Optima', 3.0),
 ('A4', 2.0),
 ('MALIBU (CHEVELLE)', 2.0),
 ('ACURA', 1.0),
 ('CX-9', 1.0),
 ('ELANTRA', 1.0),
 ('FLEX', 1.0),
 ('MKS', 1.0),
 ('OTHER (EXPLAIN IN NARRATIVE)', 1.0),
 ('PATRIOT', 1.0),
 ('SOUL', 1.0),
 ('Trail Blazer', 1.0),
 ('VERSA', 1.0),
 ('328i', None),
 ('ALTIMA', None),
 ('CX-3', None),
 ('EQUINOX', None),
 ('ESCAPE (SUV)', None),
 ('FOCUS', None),
 ('FUSION', None),
 ('Highlander(beginning vehicle year 2001)', None),
 ('LINCOLN PARK MOBILE HOMES, INC., SHIPSHEWNAN, IN', None),
 ('MDX', None),
 ('NISSAN ALTIMA', None),
 ('OPTIMA / K5', None),
 ('PASSAT', None),
 ('Prius', None),
 ('RANGE ROVER OF NORTH AMERICA', None),
 ('SE-V6', None),
 ('SENTRA (DATSUN AND NISSAN HAVE MERGED)', None),
 ('SONATA', None),
 ('Sportage (sport utility)', None)]